una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc4320_m4.h
/* BASE_SAFE_CLK control register */
typedef struct {
  __REG32  PD             : 1;
  __REG32                 :10;
  __REG32  AUTOBLOCK      : 1;
  __REG32                 :12;
  __REG32  CLK_SEL        : 5;
  __REG32                 : 3;
} __cgu_base_xxx_clk_bits;


/* CCU1/2 power mode register */
typedef struct {
  __REG32  PD             : 1;
  __REG32                 :31;
} __ccu_pm_bits;

/* CCU1 base clock status register */
typedef struct {
  __REG32  BASE_APB3_CLK_IND   : 1;
  __REG32  BASE_APB1_CLK_IND   : 1;
  __REG32  BASE_SPIFI_CLK_IND  : 1;
  __REG32  BASE_M4_CLK_IND     : 1;
  __REG32                      : 2;
  __REG32  BASE_PERIPH_CLK_IND : 1;
  __REG32  BASE_USB0_CLK_IND   : 1;
  __REG32  									   : 1;
  __REG32  BASE_SPI_CLK_IND    : 1;
  __REG32                      :22;
} __ccu1_base_stat_bits;

/* CCU2 base clock status register */
typedef struct {
  __REG32                     : 1;
  __REG32  BASE_UART3_CLK     : 1;
  __REG32  BASE_UART2_CLK     : 1;
  __REG32  BASE_UART1_CLK     : 1;
  __REG32  BASE_UART0_CLK     : 1;
  __REG32  BASE_SSP1_CLK      : 1;
  __REG32  BASE_SSP0_CLK      : 1;
  __REG32                     :25;
} __ccu2_base_stat_bits;

/* CCU1/2 branch clock configuration register */
/* CCU1/2 branch clock status register */
typedef struct {
  __REG32  RUN                : 1;
  __REG32  AUTO               : 1;
  __REG32  WAKEUP             : 1;
  __REG32                     :29;
} __ccu_clk_cfg_bits;

/* CCU1 CLK_EMCDIV_CFG branch clock configuration register */
typedef struct {
  __REG32  RUN                : 1;
  __REG32  AUTO               : 1;
  __REG32  WAKEUP             : 1;
  __REG32                     : 2;
  __REG32  DIV                : 3;
  __REG32                     :24;
} __ccu1_clk_emcdiv_cfg_bits;


/* Reset control register 0 */

#define RGU_RESET_CTRL0_CORE_RST      (0x00000001UL)
#define RGU_RESET_CTRL0_PERIPH_RST    (0x00000002UL)
#define RGU_RESET_CTRL0_MASTER_RST    (0x00000004UL)
#define RGU_RESET_CTRL0_WWDT_RST      (0x00000010UL)
#define RGU_RESET_CTRL0_CREG_RST      (0x00000020UL)
#define RGU_RESET_CTRL0_BUS_RST       (0x00000100UL)
#define RGU_RESET_CTRL0_SCU_RST       (0x00000200UL)
#define RGU_RESET_CTRL0_PINMUX_RST    (0x00000400UL)
#define RGU_RESET_CTRL0_M4_RST        (0x00002000UL)
#define RGU_RESET_CTRL0_USB0_RST      (0x00020000UL)
#define RGU_RESET_CTRL0_DMA_RST       (0x00080000UL)
#define RGU_RESET_CTRL0_SDIO_RST      (0x00100000UL)
#define RGU_RESET_CTRL0_EMC_RST       (0x00200000UL)
#define RGU_RESET_CTRL0_GPIO_RST      (0x10000000UL)

/* Reset active status register 0 */
typedef struct {
  __REG32  CORE_RST           : 1;
  __REG32  PERIPH_RST         : 1;
  __REG32  MASTER_RST         : 1;
  __REG32                     : 1;
  __REG32  WWDT_RST           : 1;
  __REG32  CREG_RST           : 1;
  __REG32                     : 2;
  __REG32  BUS_RST            : 1;
  __REG32  SCU_RST            : 1;
  __REG32  PINMUX_RST         : 1;
  __REG32                     : 2;
  __REG32  M4_RST             : 1;
  __REG32                     : 3;
  __REG32  USB0_RST           : 1;
  __REG32  				            : 1;
  __REG32  DMA_RST            : 1;
  __REG32  SDIO_RST           : 1;
  __REG32  EMC_RST            : 1;
  __REG32                     : 6;
  __REG32  GPIO_RST           : 1;
  __REG32                     : 3;
} __rgu_reset_active_status0_bits;

/* Reset control register 1 */

#define RGU_RESET_CTRL1_TIMER0_RST      (0x00000001UL)
#define RGU_RESET_CTRL1_TIMER1_RST      (0x00000002UL)
#define RGU_RESET_CTRL1_TIMER2_RST      (0x00000004UL)
#define RGU_RESET_CTRL1_TIMER3_RST      (0x00000008UL)
#define RGU_RESET_CTRL1_RITIMER_RST     (0x00000010UL)
#define RGU_RESET_CTRL1_SCT_RST         (0x00000020UL)
#define RGU_RESET_CTRL1_MOTOCONPWM_RST  (0x00000040UL)
#define RGU_RESET_CTRL1_ADC0_RST        (0x00000100UL)
#define RGU_RESET_CTRL1_ADC1_RST        (0x00000200UL)
#define RGU_RESET_CTRL1_DAC_RST         (0x00000400UL)
#define RGU_RESET_CTRL1_UART0_RST       (0x00001000UL)
#define RGU_RESET_CTRL1_UART1_RST       (0x00002000UL)
#define RGU_RESET_CTRL1_UART2_RST       (0x00004000UL)
#define RGU_RESET_CTRL1_UART3_RST       (0x00008000UL)
#define RGU_RESET_CTRL1_I2C0_RST        (0x00010000UL)
#define RGU_RESET_CTRL1_I2C1_RST        (0x00020000UL)
#define RGU_RESET_CTRL1_SSP0_RST        (0x00040000UL)
#define RGU_RESET_CTRL1_SSP1_RST        (0x00080000UL)
#define RGU_RESET_CTRL1_I2S_RST         (0x00100000UL)
#define RGU_RESET_CTRL1_SPIFI_RST       (0x00200000UL)
#define RGU_RESET_CTRL1_CAN1_RST        (0x00400000UL)
#define RGU_RESET_CTRL1_CAN0_RST        (0x00800000UL)
#define RGU_RESET_CTRL1_M0APP_RST       (0x01000000UL)
#define RGU_RESET_CTRL1_SGPIO_RST       (0x02000000UL)
#define RGU_RESET_CTRL1_SPI_RST         (0x04000000UL)

/* Reset active status register 1 */
typedef struct {
  __REG32  TIMER0_RST         : 1;
  __REG32  TIMER1_RST         : 1;
  __REG32  TIMER2_RST         : 1;
  __REG32  TIMER3_RST         : 1;
  __REG32  RITIMER_RST        : 1;
  __REG32  SCT_RST            : 1;
  __REG32  MOTOCONPWM_RST     : 1;
  __REG32  				            : 1;
  __REG32  ADC0_RST           : 1;
  __REG32  ADC1_RST           : 1;
  __REG32  DAC_RST            : 1;
  __REG32                     : 1;
  __REG32  UART0_RST          : 1;
  __REG32  UART1_RST          : 1;
  __REG32  UART2_RST          : 1;
  __REG32  UART3_RST          : 1;
  __REG32  I2C0_RST           : 1;
  __REG32  I2C1_RST           : 1;
  __REG32  SSP0_RST           : 1;
  __REG32  SSP1_RST           : 1;
  __REG32  I2S_RST            : 1;
  __REG32  SPIFI_RST          : 1;
  __REG32  CAN1_RST           : 1;
  __REG32  CAN0_RST           : 1;
  __REG32  M0APP_RST          : 1;
  __REG32  SGPIO_RST          : 1;
  __REG32  SPI_RST            : 1;
  __REG32                     : 5;
} __rgu_reset_active_status1_bits;

/* Reset status register 0 */
typedef struct {
  __REG32  CORE_RST           : 2;
  __REG32  PERIPH_RST         : 2;
  __REG32  MASTER_RST         : 2;
  __REG32                     : 2;
  __REG32  WWDT_RST           : 2;
  __REG32  CREG_RST           : 2;
  __REG32                     : 4;
  __REG32  BUS_RST            : 2;
  __REG32  SCU_RST            : 2;
  __REG32                     : 6;
  __REG32  M4_RST             : 2;
  __REG32                     : 4;
} __rgu_reset_status0_bits;

/* Reset status register 1 */
typedef struct {
  __REG32  				            : 2;
  __REG32  USB0_RST           : 2;
  __REG32  				            : 2;
  __REG32  DMA_RST            : 2;
  __REG32  SDIO_RST           : 2;
  __REG32  EMC_RST            : 2;
  __REG32                     :12;
  __REG32  GPIO_RST           : 2;
  __REG32                     : 6;
} __rgu_reset_status1_bits;

