una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc4320_m4.h
/* DMA Channel Control Registers */
typedef struct{
__REG32 TRANSFERSIZE  :12;
__REG32 SBSIZE        : 3;
__REG32 DBSIZE        : 3;
__REG32 SWIDTH        : 3;
__REG32 DWIDTH        : 3;
__REG32 S             : 1;
__REG32 D             : 1;
__REG32 SI            : 1;
__REG32 DI            : 1;
__REG32 PROT1         : 1;
__REG32 PROT2         : 1;
__REG32 PROT3         : 1;
__REG32 I             : 1;
} __dma_ctrl_bits;

/* DMA Channel Configuration Registers */
typedef struct{
__REG32 E               : 1;
__REG32 SRCPERIPHERAL   : 5;
__REG32 DESTPERIPHERAL  : 5;
__REG32 FLOWCNTRL       : 3;
__REG32 IE              : 1;
__REG32 ITC             : 1;
__REG32 L               : 1;
__REG32 A               : 1;
__REG32 H               : 1;
__REG32                 :13;
} __dma_cfg_bits;


/* SDIO Control register */
typedef struct{
__REG32 CONTROLLER_RESET              : 1;
__REG32 FIFO_RESET                    : 1;
__REG32 DMA_RESET                     : 1;
__REG32                               : 1;
__REG32 INT_ENABLE                    : 1;
__REG32 DMA_ENABLE                    : 1;
__REG32 READ_WAIT                     : 1;
__REG32 SEND_IRQ_RESPONSE             : 1;
__REG32 ABORT_READ_DATA               : 1;
__REG32 SEND_CCSD                     : 1;
__REG32 SEND_AUTO_STOP_CCSD           : 1;
__REG32 CEATA_DEVICE_INTERRUPT_STATUS : 1;
__REG32                               : 4;
__REG32 CARD_VOLTAGE_A                : 4;
__REG32 CARD_VOLTAGE_B                : 4;
__REG32 ENABLE_OD_PULLUP              : 1;
__REG32 USE_INTERNAL_DMAC             : 1;
__REG32                               : 6;
} __sdio_ctrl_bits;

/* SDIO Power Enable register */
typedef struct{
__REG32 POWER_ENABLE    : 1;
__REG32                 :31;
} __sdio_pwren_bits;

/* SDIO Clock Divider register */
typedef struct{
__REG32 CLK_DIVIDER0    : 8;
__REG32 CLK_DIVIDER1    : 8;
__REG32 CLK_DIVIDER2    : 8;
__REG32 CLK_DIVIDER3    : 8;
} __sdio_clkdiv_bits;

/* SDIO Clock Source register */
typedef struct{
__REG32 CLK_SOURCE      : 2;
__REG32                 :30;
} __sdio_clksrc_bits;

/* SDIO Clock Enable register */
typedef struct{
__REG32 CCLK_ENABLE     : 1;
__REG32                 :15;
__REG32 CCLK_LOW_POWER  : 1;
__REG32                 :15;
} __sdio_clkena_bits;

/* SDIO Time-out register */
typedef struct{
__REG32 RESPONSE_TIMEOUT : 8;
__REG32 DATA_TIMEOUT     :24;
} __sdio_tmout_bits;

/* SDIO Card Type register */
typedef struct{
__REG32 CARD_WIDTH0        : 1;
__REG32                    :15;
__REG32 CARD_WIDTH1        : 1;
__REG32                    :15;
} __sdio_ctype_bits;

/* SDIO Block Size register */
typedef struct{
__REG32 BLOCK_SIZE      :16;
__REG32                 :16;
} __sdio_blksiz_bits;

/* SDIO Interrupt Mask register */
typedef struct{
__REG32 CDET              : 1;
__REG32 RE                : 1;
__REG32 CDONE             : 1;
__REG32 DTO               : 1;
__REG32 TXDR              : 1;
__REG32 RXDR              : 1;
__REG32 RCRC              : 1;
__REG32 DCRC              : 1;
__REG32 RTO               : 1;
__REG32 DRTO              : 1;
__REG32 HTO               : 1;
__REG32 FRUN              : 1;
__REG32 HLE               : 1;
__REG32 SBE               : 1;
__REG32 ACD               : 1;
__REG32 EBE               : 1;
__REG32 SDIO_INT_MASK     : 1;
__REG32                   :15;
} __sdio_intmask_bits;

/* SDIO Command register */
typedef struct{
__REG32 CMD_INDEX                  : 6;
__REG32 RESPONSE_EXPECT            : 1;
__REG32 RESPONSE_LENGTH            : 1;
__REG32 CHECK_RESPONSE_CRC         : 1;
__REG32 DATA_EXPECTED              : 1;
__REG32 READ_WRITE                 : 1;
__REG32 TRANSFER_MODE              : 1;
__REG32 SEND_AUTO_STOP             : 1;
__REG32 WAIT_PRVDATA_COMPLETE      : 1;
__REG32 STOP_ABORT_CMD             : 1;
__REG32 SEND_INITIALIZATION        : 1;
__REG32                            : 5;
__REG32 UPDATE_CLOC_REGISTERS_ONLY : 1;
__REG32 READ_CEATA_DEVICE          : 1;
__REG32 CCS_EXPECTED               : 1;
__REG32 ENABLE_BOOT                : 1;
__REG32 EXPECT_BOOT_ACK            : 1;
__REG32 DISABLE_BOOT               : 1;
__REG32 BOOT_MODE                  : 1;
__REG32 VOLT_SWITCH                : 1;
__REG32                            : 2;
__REG32 START_CMD                  : 1;
} __sdio_cmd_bits;

/* SDIO Masked Interrupt Status register */
typedef struct{
__REG32 CDET              : 1;
__REG32 RE                : 1;
__REG32 CDONE             : 1;
__REG32 DTO               : 1;
__REG32 TXDR              : 1;
__REG32 RXDR              : 1;
__REG32 RCRC              : 1;
__REG32 DCRC              : 1;
__REG32 RTO               : 1;
__REG32 DRTO              : 1;
__REG32 HTO               : 1;
__REG32 FRUN              : 1;
__REG32 HLE               : 1;
__REG32 SBE               : 1;
__REG32 ACD               : 1;
__REG32 EBE               : 1;
__REG32 SDIO_INTERRUPT    : 1;
__REG32                   :15;
} __sdio_mintsts_bits;

/* SDIO Raw Interrupt Status register */
typedef struct{
__REG32 CDET              : 1;
__REG32 RE                : 1;
__REG32 CDONE             : 1;
__REG32 DTO               : 1;
__REG32 TXDR              : 1;
__REG32 RXDR              : 1;
__REG32 RCRC              : 1;
__REG32 DCRC              : 1;
__REG32 RTO_BAR           : 1;
__REG32 DRTO_BDS          : 1;
__REG32 HTO               : 1;
__REG32 FRUN              : 1;
__REG32 HLE               : 1;
__REG32 SBE               : 1;
__REG32 ACD               : 1;
__REG32 EBE               : 1;
__REG32 SDIO_INTERRUPT    : 1;
__REG32                   :15;
} __sdio_rintsts_bits;

/* SDIO Status register */
typedef struct{
__REG32 FIFO_RX_WATERMARK   : 1;
__REG32 FIFO_TX_WATERMARK   : 1;
__REG32 FIFO_EMPTY          : 1;
__REG32 FIFO_FULL           : 1;
__REG32 CMDFSMSTATES        : 4;
__REG32 DATA_3_STATUS       : 1;
__REG32 DATA_BUSY           : 1;
__REG32 DATA_STATE_MC_BUSY  : 1;
__REG32 RESPONSE_INDEX      : 6;
__REG32 FIFO_COUNT          :13;
__REG32 DMA_ACK             : 1;
__REG32 DMA_REQ             : 1;
} __sdio_status_bits;

/* SDIO FIFO threshold Watermark register */
typedef struct{
__REG32 TX_WMARK                        :12;
__REG32                                 : 4;
__REG32 RX_WMARK                        :12;
__REG32 DW_DMA_MUTIPLE_TRANSACTION_SIZE : 3;
__REG32                                 : 1;
} __sdio_fifoth_bits;

/* SDIO Card Detect register */
typedef struct{
__REG32 CARD_DETECT         : 1;
__REG32                     :31;
} __sdio_cdetect_bits;

/* SDIO Write Protect register */
typedef struct{
__REG32 WRITE_PROTECT       : 1;
__REG32                     :31;
} __sdio_wrtprt_bits;

/* SDIO General Purpose Input/Ouput register */
/*
typedef struct{
__REG32 GPI                 : 8;
__REG32 GPO                 :16;
__REG32                     : 8;
} __sdio_gpio_bits;
*/

/* SDIO Debounce Count register */
typedef struct{
__REG32 DEBOUNCE_COUNT      :24;
__REG32                     : 8;
} __sdio_debnce_bits;

