una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc4320_m4.h
/* SCT halt condition register */
typedef union{
  /* SCT_HALT */
  struct{
  __REG32 HALTMSK0_L            : 1;
  __REG32 HALTMSK1_L            : 1;
  __REG32 HALTMSK2_L            : 1;
  __REG32 HALTMSK3_L            : 1;
  __REG32 HALTMSK4_L            : 1;
  __REG32 HALTMSK5_L            : 1;
  __REG32 HALTMSK6_L            : 1;
  __REG32 HALTMSK7_L            : 1;
  __REG32 HALTMSK8_L            : 1;
  __REG32 HALTMSK9_L            : 1;
  __REG32 HALTMSK10_L           : 1;
  __REG32 HALTMSK11_L           : 1;
  __REG32 HALTMSK12_L           : 1;
  __REG32 HALTMSK13_L           : 1;
  __REG32 HALTMSK14_L           : 1;
  __REG32 HALTMSK15_L           : 1;
  __REG32 HALTMSK0_H            : 1;
  __REG32 HALTMSK1_H            : 1;
  __REG32 HALTMSK2_H            : 1;
  __REG32 HALTMSK3_H            : 1;
  __REG32 HALTMSK4_H            : 1;
  __REG32 HALTMSK5_H            : 1;
  __REG32 HALTMSK6_H            : 1;
  __REG32 HALTMSK7_H            : 1;
  __REG32 HALTMSK8_H            : 1;
  __REG32 HALTMSK9_H            : 1;
  __REG32 HALTMSK10_H           : 1;
  __REG32 HALTMSK11_H           : 1;
  __REG32 HALTMSK12_H           : 1;
  __REG32 HALTMSK13_H           : 1;
  __REG32 HALTMSK14_H           : 1;
  __REG32 HALTMSK15_H           : 1;
  };

  struct{
    union{
      /* SCT_HALT_L */
      struct{
      __REG16 HALTMSK0_L            : 1;
      __REG16 HALTMSK1_L            : 1;
      __REG16 HALTMSK2_L            : 1;
      __REG16 HALTMSK3_L            : 1;
      __REG16 HALTMSK4_L            : 1;
      __REG16 HALTMSK5_L            : 1;
      __REG16 HALTMSK6_L            : 1;
      __REG16 HALTMSK7_L            : 1;
      __REG16 HALTMSK8_L            : 1;
      __REG16 HALTMSK9_L            : 1;
      __REG16 HALTMSK10_L           : 1;
      __REG16 HALTMSK11_L           : 1;
      __REG16 HALTMSK12_L           : 1;
      __REG16 HALTMSK13_L           : 1;
      __REG16 HALTMSK14_L           : 1;
      __REG16 HALTMSK15_L           : 1;
      } __sct_halt_l_bits;
      __REG16 __sct_halt_l;
    };
    union{
      /* SCT_HALT_H */
      struct{
      __REG16 HALTMSK0_H            : 1;
      __REG16 HALTMSK1_H            : 1;
      __REG16 HALTMSK2_H            : 1;
      __REG16 HALTMSK3_H            : 1;
      __REG16 HALTMSK4_H            : 1;
      __REG16 HALTMSK5_H            : 1;
      __REG16 HALTMSK6_H            : 1;
      __REG16 HALTMSK7_H            : 1;
      __REG16 HALTMSK8_H            : 1;
      __REG16 HALTMSK9_H            : 1;
      __REG16 HALTMSK10_H           : 1;
      __REG16 HALTMSK11_H           : 1;
      __REG16 HALTMSK12_H           : 1;
      __REG16 HALTMSK13_H           : 1;
      __REG16 HALTMSK14_H           : 1;
      __REG16 HALTMSK15_H           : 1;
      } __sct_halt_h_bits;
      __REG16 __sct_halt_h;
    };
  };
} __sct_halt_bits;


/* SCT stop condition register */
typedef union{
  /* SCT_STOP */
  struct{
  __REG32 STOPMSK0_L            : 1;
  __REG32 STOPMSK1_L            : 1;
  __REG32 STOPMSK2_L            : 1;
  __REG32 STOPMSK3_L            : 1;
  __REG32 STOPMSK4_L            : 1;
  __REG32 STOPMSK5_L            : 1;
  __REG32 STOPMSK6_L            : 1;
  __REG32 STOPMSK7_L            : 1;
  __REG32 STOPMSK8_L            : 1;
  __REG32 STOPMSK9_L            : 1;
  __REG32 STOPMSK10_L           : 1;
  __REG32 STOPMSK11_L           : 1;
  __REG32 STOPMSK12_L           : 1;
  __REG32 STOPMSK13_L           : 1;
  __REG32 STOPMSK14_L           : 1;
  __REG32 STOPMSK15_L           : 1;
  __REG32 STOPMSK0_H            : 1;
  __REG32 STOPMSK1_H            : 1;
  __REG32 STOPMSK2_H            : 1;
  __REG32 STOPMSK3_H            : 1;
  __REG32 STOPMSK4_H            : 1;
  __REG32 STOPMSK5_H            : 1;
  __REG32 STOPMSK6_H            : 1;
  __REG32 STOPMSK7_H            : 1;
  __REG32 STOPMSK8_H            : 1;
  __REG32 STOPMSK9_H            : 1;
  __REG32 STOPMSK10_H           : 1;
  __REG32 STOPMSK11_H           : 1;
  __REG32 STOPMSK12_H           : 1;
  __REG32 STOPMSK13_H           : 1;
  __REG32 STOPMSK14_H           : 1;
  __REG32 STOPMSK15_H           : 1;
  };

  struct{
    union{
      /* SCT_STOP_L */
      struct{
        __REG16 STOPMSK0_L            : 1;
        __REG16 STOPMSK1_L            : 1;
        __REG16 STOPMSK2_L            : 1;
        __REG16 STOPMSK3_L            : 1;
        __REG16 STOPMSK4_L            : 1;
        __REG16 STOPMSK5_L            : 1;
        __REG16 STOPMSK6_L            : 1;
        __REG16 STOPMSK7_L            : 1;
        __REG16 STOPMSK8_L            : 1;
        __REG16 STOPMSK9_L            : 1;
        __REG16 STOPMSK10_L           : 1;
        __REG16 STOPMSK11_L           : 1;
        __REG16 STOPMSK12_L           : 1;
        __REG16 STOPMSK13_L           : 1;
        __REG16 STOPMSK14_L           : 1;
        __REG16 STOPMSK15_L           : 1;
      } __sct_stop_l_bits;
      __REG16 __sct_stop_l;
    };
    union{
      /* SCT_STOP_H */
      struct{
      __REG16 STOPMSK0_H            : 1;
      __REG16 STOPMSK1_H            : 1;
      __REG16 STOPMSK2_H            : 1;
      __REG16 STOPMSK3_H            : 1;
      __REG16 STOPMSK4_H            : 1;
      __REG16 STOPMSK5_H            : 1;
      __REG16 STOPMSK6_H            : 1;
      __REG16 STOPMSK7_H            : 1;
      __REG16 STOPMSK8_H            : 1;
      __REG16 STOPMSK9_H            : 1;
      __REG16 STOPMSK10_H           : 1;
      __REG16 STOPMSK11_H           : 1;
      __REG16 STOPMSK12_H           : 1;
      __REG16 STOPMSK13_H           : 1;
      __REG16 STOPMSK14_H           : 1;
      __REG16 STOPMSK15_H           : 1;
      } __sct_stop_h_bits;
      __REG16 __sct_stop_h;
    };
  };
} __sct_stop_bits;

/* SCT start condition register */
typedef union{
  /* SCT_START */
  struct{
  __REG32 STARTMSK0_L           : 1;
  __REG32 STARTMSK1_L           : 1;
  __REG32 STARTMSK2_L           : 1;
  __REG32 STARTMSK3_L           : 1;
  __REG32 STARTMSK4_L           : 1;
  __REG32 STARTMSK5_L           : 1;
  __REG32 STARTMSK6_L           : 1;
  __REG32 STARTMSK7_L           : 1;
  __REG32 STARTMSK8_L           : 1;
  __REG32 STARTMSK9_L           : 1;
  __REG32 STARTMSK10_L          : 1;
  __REG32 STARTMSK11_L          : 1;
  __REG32 STARTMSK12_L          : 1;
  __REG32 STARTMSK13_L          : 1;
  __REG32 STARTMSK14_L          : 1;
  __REG32 STARTMSK15_L          : 1;
  __REG32 STARTMSK0_H           : 1;
  __REG32 STARTMSK1_H           : 1;
  __REG32 STARTMSK2_H           : 1;
  __REG32 STARTMSK3_H           : 1;
  __REG32 STARTMSK4_H           : 1;
  __REG32 STARTMSK5_H           : 1;
  __REG32 STARTMSK6_H           : 1;
  __REG32 STARTMSK7_H           : 1;
  __REG32 STARTMSK8_H           : 1;
  __REG32 STARTMSK9_H           : 1;
  __REG32 STARTMSK10_H          : 1;
  __REG32 STARTMSK11_H          : 1;
  __REG32 STARTMSK12_H          : 1;
  __REG32 STARTMSK13_H          : 1;
  __REG32 STARTMSK14_H          : 1;
  __REG32 STARTMSK15_H          : 1;
  };

  struct{
    union{
      /* SCT_START_L */
      struct{
      __REG16 STARTMSK0_L           : 1;
      __REG16 STARTMSK1_L           : 1;
      __REG16 STARTMSK2_L           : 1;
      __REG16 STARTMSK3_L           : 1;
      __REG16 STARTMSK4_L           : 1;
      __REG16 STARTMSK5_L           : 1;
      __REG16 STARTMSK6_L           : 1;
      __REG16 STARTMSK7_L           : 1;
      __REG16 STARTMSK8_L           : 1;
      __REG16 STARTMSK9_L           : 1;
      __REG16 STARTMSK10_L          : 1;
      __REG16 STARTMSK11_L          : 1;
      __REG16 STARTMSK12_L          : 1;
      __REG16 STARTMSK13_L          : 1;
      __REG16 STARTMSK14_L          : 1;
      __REG16 STARTMSK15_L          : 1;
      } __sct_start_l_bits;
      __REG16 __sct_start_l;
    };
    union{
      /* SCT_START_H */
      struct{
      __REG16 STARTMSK0_H           : 1;
      __REG16 STARTMSK1_H           : 1;
      __REG16 STARTMSK2_H           : 1;
      __REG16 STARTMSK3_H           : 1;
      __REG16 STARTMSK4_H           : 1;
      __REG16 STARTMSK5_H           : 1;
      __REG16 STARTMSK6_H           : 1;
      __REG16 STARTMSK7_H           : 1;
      __REG16 STARTMSK8_H           : 1;
      __REG16 STARTMSK9_H           : 1;
      __REG16 STARTMSK10_H          : 1;
      __REG16 STARTMSK11_H          : 1;
      __REG16 STARTMSK12_H          : 1;
      __REG16 STARTMSK13_H          : 1;
      __REG16 STARTMSK14_H          : 1;
      __REG16 STARTMSK15_H          : 1;
      } __sct_start_h_bits;
      __REG16 __sct_start_h;
    };
  };
} __sct_start_bits;

/* SCT counter register */
typedef union{
  /* SCT_COUNT */
  struct{
  __REG32 CTR_L                 :16;
  __REG32 CTR_H                 :16;
  };
  struct{
    __REG16 __sct_count_l;
    __REG16 __sct_count_h;
  };
} __sct_count_bits;

/* SCT state register */
typedef union{
   /* SCT_STATE */
  struct{
  __REG32 STATE_L               : 5;
  __REG32                       :11;
  __REG32 STATE_H               : 5;
  __REG32                       :11;
  };
  struct{
    union{
      /* SCT_STATE_L */
      struct{
      __REG16 STATE_L               : 5;
      __REG16                       :11;
      } __sct_state_l_bits;
      __REG16 __sct_state_l;
    };
    union{
      /* SCT_STATE_H */
      struct{
      __REG16 STATE_H               : 5;
      __REG16                       :11;
      } __sct_state_h_bits;
      __REG16 __sct_state_h;
    };
  };
} __sct_state_bits;

/* SCT input register */
typedef struct{
__REG32 AIN0                  : 1;
__REG32 AIN1                  : 1;
__REG32 AIN2                  : 1;
__REG32 AIN3                  : 1;
__REG32 AIN4                  : 1;
__REG32 AIN5                  : 1;
__REG32 AIN6                  : 1;
__REG32 AIN7                  : 1;
__REG32                       : 8;
__REG32 SIN0                  : 1;
__REG32 SIN1                  : 1;
__REG32 SIN2                  : 1;
__REG32 SIN3                  : 1;
__REG32 SIN4                  : 1;
__REG32 SIN5                  : 1;
__REG32 SIN6                  : 1;
__REG32 SIN7                  : 1;
__REG32                       : 8;
} __sct_input_bits;

/* SCT match/capture registers mode register */
typedef union{
  /* SCT_REGMODE */
  struct{
  __REG32 REGMOD0_L             : 1;
  __REG32 REGMOD1_L             : 1;
  __REG32 REGMOD2_L             : 1;
  __REG32 REGMOD3_L             : 1;
  __REG32 REGMOD4_L             : 1;
  __REG32 REGMOD5_L             : 1;
  __REG32 REGMOD6_L             : 1;
  __REG32 REGMOD7_L             : 1;
  __REG32 REGMOD8_L             : 1;
  __REG32 REGMOD9_L             : 1;
  __REG32 REGMOD10_L            : 1;
  __REG32 REGMOD11_L            : 1;
  __REG32 REGMOD12_L            : 1;
  __REG32 REGMOD13_L            : 1;
  __REG32 REGMOD14_L            : 1;
  __REG32 REGMOD15_L            : 1;
  __REG32 REGMOD0_H             : 1;
  __REG32 REGMOD1_H             : 1;
  __REG32 REGMOD2_H             : 1;
  __REG32 REGMOD3_H             : 1;
  __REG32 REGMOD4_H             : 1;
  __REG32 REGMOD5_H             : 1;
  __REG32 REGMOD6_H             : 1;
  __REG32 REGMOD7_H             : 1;
  __REG32 REGMOD8_H             : 1;
  __REG32 REGMOD9_H             : 1;
  __REG32 REGMOD10_H            : 1;
  __REG32 REGMOD11_H            : 1;
  __REG32 REGMOD12_H            : 1;
  __REG32 REGMOD13_H            : 1;
  __REG32 REGMOD14_H            : 1;
  __REG32 REGMOD15_H            : 1;
  };

  struct{
    union{
      /* SCT_REGMODE_L */
      struct{
      __REG16 REGMOD0_L             : 1;
      __REG16 REGMOD1_L             : 1;
      __REG16 REGMOD2_L             : 1;
      __REG16 REGMOD3_L             : 1;
      __REG16 REGMOD4_L             : 1;
      __REG16 REGMOD5_L             : 1;
      __REG16 REGMOD6_L             : 1;
      __REG16 REGMOD7_L             : 1;
      __REG16 REGMOD8_L             : 1;
      __REG16 REGMOD9_L             : 1;
      __REG16 REGMOD10_L            : 1;
      __REG16 REGMOD11_L            : 1;
      __REG16 REGMOD12_L            : 1;
      __REG16 REGMOD13_L            : 1;
      __REG16 REGMOD14_L            : 1;
      __REG16 REGMOD15_L            : 1;
      } __sct_regmode_l_bits;
      __REG16 __sct_regmode_l;
    };
    union{
      /* SCT_REGMODE_H */
      struct{
      __REG16 REGMOD0_H             : 1;
      __REG16 REGMOD1_H             : 1;
      __REG16 REGMOD2_H             : 1;
      __REG16 REGMOD3_H             : 1;
      __REG16 REGMOD4_H             : 1;
      __REG16 REGMOD5_H             : 1;
      __REG16 REGMOD6_H             : 1;
      __REG16 REGMOD7_H             : 1;
      __REG16 REGMOD8_H             : 1;
      __REG16 REGMOD9_H             : 1;
      __REG16 REGMOD10_H            : 1;
      __REG16 REGMOD11_H            : 1;
      __REG16 REGMOD12_H            : 1;
      __REG16 REGMOD13_H            : 1;
      __REG16 REGMOD14_H            : 1;
      __REG16 REGMOD15_H            : 1;
      } __sct_regmode_h_bits;
      __REG16 __sct_regmode_h;
    };
  };
} __sct_regmode_bits;

/* SCT output register */
typedef struct{
__REG32 OUT0                  : 1;
__REG32 OUT1                  : 1;
__REG32 OUT2                  : 1;
__REG32 OUT3                  : 1;
__REG32 OUT4                  : 1;
__REG32 OUT5                  : 1;
__REG32 OUT6                  : 1;
__REG32 OUT7                  : 1;
__REG32 OUT8                  : 1;
__REG32 OUT9                  : 1;
__REG32 OUT10                 : 1;
__REG32 OUT11                 : 1;
__REG32 OUT12                 : 1;
__REG32 OUT13                 : 1;
__REG32 OUT14                 : 1;
__REG32 OUT15                 : 1;
__REG32                       :16;
} __sct_output_bits;

/* SCT bidirectional output control register */
typedef struct{
__REG32 SETCLR0               : 2;
__REG32 SETCLR1               : 2;
__REG32 SETCLR2               : 2;
__REG32 SETCLR3               : 2;
__REG32 SETCLR4               : 2;
__REG32 SETCLR5               : 2;
__REG32 SETCLR6               : 2;
__REG32 SETCLR7               : 2;
__REG32 SETCLR8               : 2;
__REG32 SETCLR9               : 2;
__REG32 SETCLR10              : 2;
__REG32 SETCLR11              : 2;
__REG32 SETCLR12              : 2;
__REG32 SETCLR13              : 2;
__REG32 SETCLR14              : 2;
__REG32 SETCLR15              : 2;
} __sct_outputdirctrl_bits;

/* SCT conflict resolution register */
typedef struct{
__REG32 O0RES                 : 2;
__REG32 O1RES                 : 2;
__REG32 O2RES                 : 2;
__REG32 O3RES                 : 2;
__REG32 O4RES                 : 2;
__REG32 O5RES                 : 2;
__REG32 O6RES                 : 2;
__REG32 O7RES                 : 2;
__REG32 O8RES                 : 2;
__REG32 O9RES                 : 2;
__REG32 O10RES                : 2;
__REG32 O11RES                : 2;
__REG32 O12RES                : 2;
__REG32 O13RES                : 2;
__REG32 O14RES                : 2;
__REG32 O15RES                : 2;
} __sct_res_bits;

/* SCT DMA request 0 */
typedef struct{
__REG32 DEV0_0                : 1;
__REG32 DEV1_0                : 1;
__REG32 DEV2_0                : 1;
__REG32 DEV3_0                : 1;
__REG32 DEV4_0                : 1;
__REG32 DEV5_0                : 1;
__REG32 DEV6_0                : 1;
__REG32 DEV7_0                : 1;
__REG32 DEV8_0                : 1;
__REG32 DEV9_0                : 1;
__REG32 DEV10_0               : 1;
__REG32 DEV11_0               : 1;
__REG32 DEV12_0               : 1;
__REG32 DEV13_0               : 1;
__REG32 DEV14_0               : 1;
__REG32 DEV15_0               : 1;
__REG32                       :14;
__REG32 DRL0                  : 1;
__REG32 DRQ0                  : 1;
} __sct_dmareq0_bits;

/* SCT DMA request 1 */
typedef struct{
__REG32 DEV0_1                : 1;
__REG32 DEV1_1                : 1;
__REG32 DEV2_1                : 1;
__REG32 DEV3_1                : 1;
__REG32 DEV4_1                : 1;
__REG32 DEV5_1                : 1;
__REG32 DEV6_1                : 1;
__REG32 DEV7_1                : 1;
__REG32 DEV8_1                : 1;
__REG32 DEV9_1                : 1;
__REG32 DEV10_1               : 1;
__REG32 DEV11_1               : 1;
__REG32 DEV12_1               : 1;
__REG32 DEV13_1               : 1;
__REG32 DEV14_1               : 1;
__REG32 DEV15_1               : 1;
__REG32                       :14;
__REG32 DRL1                  : 1;
__REG32 DRQ1                  : 1;
} __sct_dmareq1_bits;

/* SCT flag enable register */
typedef struct{
__REG32 IEN0                  : 1;
__REG32 IEN1                  : 1;
__REG32 IEN2                  : 1;
__REG32 IEN3                  : 1;
__REG32 IEN4                  : 1;
__REG32 IEN5                  : 1;
__REG32 IEN6                  : 1;
__REG32 IEN7                  : 1;
__REG32 IEN8                  : 1;
__REG32 IEN9                  : 1;
__REG32 IEN10                 : 1;
__REG32 IEN11                 : 1;
__REG32 IEN12                 : 1;
__REG32 IEN13                 : 1;
__REG32 IEN14                 : 1;
__REG32 IEN15                 : 1;
__REG32                       :16;
} __sct_even_bits;

/* SCT event flag register */
typedef struct{
__REG32 FLAG0                 : 1;
__REG32 FLAG1                 : 1;
__REG32 FLAG2                 : 1;
__REG32 FLAG3                 : 1;
__REG32 FLAG4                 : 1;
__REG32 FLAG5                 : 1;
__REG32 FLAG6                 : 1;
__REG32 FLAG7                 : 1;
__REG32 FLAG8                 : 1;
__REG32 FLAG9                 : 1;
__REG32 FLAG10                : 1;
__REG32 FLAG11                : 1;
__REG32 FLAG12                : 1;
__REG32 FLAG13                : 1;
__REG32 FLAG14                : 1;
__REG32 FLAG15                : 1;
__REG32                       :16;
} __sct_evflag_bits;

/* SCT conflict enable register */
typedef struct{
__REG32 NCEN0                 : 1;
__REG32 NCEN1                 : 1;
__REG32 NCEN2                 : 1;
__REG32 NCEN3                 : 1;
__REG32 NCEN4                 : 1;
__REG32 NCEN5                 : 1;
__REG32 NCEN6                 : 1;
__REG32 NCEN7                 : 1;
__REG32 NCEN8                 : 1;
__REG32 NCEN9                 : 1;
__REG32 NCEN10                : 1;
__REG32 NCEN11                : 1;
__REG32 NCEN12                : 1;
__REG32 NCEN13                : 1;
__REG32 NCEN14                : 1;
__REG32 NCEN15                : 1;
__REG32                       :16;
} __sct_conen_bits;

