una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc4320_m4.h
/* SCT conflict flag register */
typedef struct{
__REG32 NCFLAG0               : 1;
__REG32 NCFLAG1               : 1;
__REG32 NCFLAG2               : 1;
__REG32 NCFLAG3               : 1;
__REG32 NCFLAG4               : 1;
__REG32 NCFLAG5               : 1;
__REG32 NCFLAG6               : 1;
__REG32 NCFLAG7               : 1;
__REG32 NCFLAG8               : 1;
__REG32 NCFLAG9               : 1;
__REG32 NCFLAG10              : 1;
__REG32 NCFLAG11              : 1;
__REG32 NCFLAG12              : 1;
__REG32 NCFLAG13              : 1;
__REG32 NCFLAG14              : 1;
__REG32 NCFLAG15              : 1;
__REG32                       :14;
__REG32 BUSERRL               : 1;
__REG32 BUSERRH               : 1;
} __sct_conflag_bits;

/* SCT match and capture registers */
typedef union{
  /* SCT_MATCHx */
  struct {
    __REG32 MATCH_L             :16;
    __REG32 MATCH_H             :16;
  };
  /* SCT_CAPx */
  struct {
    __REG32 CAP_L               :16;
    __REG32 CAP_H               :16;
  };

  struct{
    __REG16 __sct_match_cap_l;
    __REG16 __sct_match_cap_h;
  };

} __sct_match_cap_bits;

/* SCT match reload and capture control registers */
typedef union{
  /* SCT_MATCHRELx */
  struct {
    __REG32 RELOAD_L            :16;
    __REG32 RELOAD_H            :16;
  };

  struct{
    __REG16 __sct_matchrel_l;
    __REG16 __sct_matchrel_h;
  };

  /* SCT_CAPCTRLx */
  struct {
    __REG32 CAPCON0_L           : 1;
    __REG32 CAPCON1_L           : 1;
    __REG32 CAPCON2_L           : 1;
    __REG32 CAPCON3_L           : 1;
    __REG32 CAPCON4_L           : 1;
    __REG32 CAPCON5_L           : 1;
    __REG32 CAPCON6_L           : 1;
    __REG32 CAPCON7_L           : 1;
    __REG32 CAPCON8_L           : 1;
    __REG32 CAPCON9_L           : 1;
    __REG32 CAPCON10_L          : 1;
    __REG32 CAPCON11_L          : 1;
    __REG32 CAPCON12_L          : 1;
    __REG32 CAPCON13_L          : 1;
    __REG32 CAPCON14_L          : 1;
    __REG32 CAPCON15_L          : 1;
    __REG32 CAPCON0_H           : 1;
    __REG32 CAPCON1_H           : 1;
    __REG32 CAPCON2_H           : 1;
    __REG32 CAPCON3_H           : 1;
    __REG32 CAPCON4_H           : 1;
    __REG32 CAPCON5_H           : 1;
    __REG32 CAPCON6_H           : 1;
    __REG32 CAPCON7_H           : 1;
    __REG32 CAPCON8_H           : 1;
    __REG32 CAPCON9_H           : 1;
    __REG32 CAPCON10_H          : 1;
    __REG32 CAPCON11_H          : 1;
    __REG32 CAPCON12_H          : 1;
    __REG32 CAPCON13_H          : 1;
    __REG32 CAPCON14_H          : 1;
    __REG32 CAPCON15_H          : 1;
  };

  struct{
    union{
      /* SCT_CAPCTRLx_L */
      struct{
      __REG16 CAPCON0_L           : 1;
      __REG16 CAPCON1_L           : 1;
      __REG16 CAPCON2_L           : 1;
      __REG16 CAPCON3_L           : 1;
      __REG16 CAPCON4_L           : 1;
      __REG16 CAPCON5_L           : 1;
      __REG16 CAPCON6_L           : 1;
      __REG16 CAPCON7_L           : 1;
      __REG16 CAPCON8_L           : 1;
      __REG16 CAPCON9_L           : 1;
      __REG16 CAPCON10_L          : 1;
      __REG16 CAPCON11_L          : 1;
      __REG16 CAPCON12_L          : 1;
      __REG16 CAPCON13_L          : 1;
      __REG16 CAPCON14_L          : 1;
      __REG16 CAPCON15_L          : 1;
      } __sct_capctrl_l_bits;
      __REG16 __sct_capctrl_l;
    };
    union{
      /* SCT_CAPCTRLx_H */
      struct{
      __REG16 CAPCON0_H           : 1;
      __REG16 CAPCON1_H           : 1;
      __REG16 CAPCON2_H           : 1;
      __REG16 CAPCON3_H           : 1;
      __REG16 CAPCON4_H           : 1;
      __REG16 CAPCON5_H           : 1;
      __REG16 CAPCON6_H           : 1;
      __REG16 CAPCON7_H           : 1;
      __REG16 CAPCON8_H           : 1;
      __REG16 CAPCON9_H           : 1;
      __REG16 CAPCON10_H          : 1;
      __REG16 CAPCON11_H          : 1;
      __REG16 CAPCON12_H          : 1;
      __REG16 CAPCON13_H          : 1;
      __REG16 CAPCON14_H          : 1;
      __REG16 CAPCON15_H          : 1;
      } __sct_capctrl_h_bits;
      __REG16 __sct_capctrl_h;
    };
  };
} __sct_matchrel_capctrl_bits;

/* SCT event state mask registers */
typedef struct{
__REG32 STATEMSK0             : 1;
__REG32 STATEMSK1             : 1;
__REG32 STATEMSK2             : 1;
__REG32 STATEMSK3             : 1;
__REG32 STATEMSK4             : 1;
__REG32 STATEMSK5             : 1;
__REG32 STATEMSK6             : 1;
__REG32 STATEMSK7             : 1;
__REG32 STATEMSK8             : 1;
__REG32 STATEMSK9             : 1;
__REG32 STATEMSK10            : 1;
__REG32 STATEMSK11            : 1;
__REG32 STATEMSK12            : 1;
__REG32 STATEMSK13            : 1;
__REG32 STATEMSK14            : 1;
__REG32 STATEMSK15            : 1;
__REG32 STATEMSK16            : 1;
__REG32 STATEMSK17            : 1;
__REG32 STATEMSK18            : 1;
__REG32 STATEMSK19            : 1;
__REG32 STATEMSK20            : 1;
__REG32 STATEMSK21            : 1;
__REG32 STATEMSK22            : 1;
__REG32 STATEMSK23            : 1;
__REG32 STATEMSK24            : 1;
__REG32 STATEMSK25            : 1;
__REG32 STATEMSK26            : 1;
__REG32 STATEMSK27            : 1;
__REG32 STATEMSK28            : 1;
__REG32 STATEMSK29            : 1;
__REG32 STATEMSK30            : 1;
__REG32 STATEMSK31            : 1;
} __sct_evstatemsk_bits;

/* SCT event control registers */
typedef struct{
__REG32 MATCHSEL              : 4;
__REG32 HEVENT                : 1;
__REG32 OUTSEL                : 1;
__REG32 IOSEL                 : 4;
__REG32 IOCOND                : 2;
__REG32 COMBMODE              : 2;
__REG32 STATELD               : 1;
__REG32 STATEV                : 5;
__REG32                       :12;
} __sct_evctrl_bits;

/* SCT output set registers */
typedef struct{
__REG32 SET0                  : 1;
__REG32 SET1                  : 1;
__REG32 SET2                  : 1;
__REG32 SET3                  : 1;
__REG32 SET4                  : 1;
__REG32 SET5                  : 1;
__REG32 SET6                  : 1;
__REG32 SET7                  : 1;
__REG32 SET8                  : 1;
__REG32 SET9                  : 1;
__REG32 SET10                 : 1;
__REG32 SET11                 : 1;
__REG32 SET12                 : 1;
__REG32 SET13                 : 1;
__REG32 SET14                 : 1;
__REG32 SET15                 : 1;
__REG32                       :16;
} __sct_outputset_bits;

