una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc4320_m4.h
#define MC_CAPCON_CLR_CAP0MCI0_RE_CLR    (0x00000001UL)
#define MC_CAPCON_CLR_CAP0MCI0_FE_CLR    (0x00000002UL)
#define MC_CAPCON_CLR_CAP0MCI1_RE_CLR    (0x00000004UL)
#define MC_CAPCON_CLR_CAP0MCI1_FE_CLR    (0x00000008UL)
#define MC_CAPCON_CLR_CAP0MCI2_RE_CLR    (0x00000010UL)
#define MC_CAPCON_CLR_CAP0MCI2_FE_CLR    (0x00000020UL)
#define MC_CAPCON_CLR_CAP1MCI0_RE_CLR    (0x00000040UL)
#define MC_CAPCON_CLR_CAP1MCI0_FE_CLR    (0x00000080UL)
#define MC_CAPCON_CLR_CAP1MCI1_RE_CLR    (0x00000100UL)
#define MC_CAPCON_CLR_CAP1MCI1_FE_CLR    (0x00000200UL)
#define MC_CAPCON_CLR_CAP1MCI2_RE_CLR    (0x00000400UL)
#define MC_CAPCON_CLR_CAP1MCI2_FE_CLR    (0x00000800UL)
#define MC_CAPCON_CLR_CAP2MCI0_RE_CLR    (0x00001000UL)
#define MC_CAPCON_CLR_CAP2MCI0_FE_CLR    (0x00002000UL)
#define MC_CAPCON_CLR_CAP2MCI1_RE_CLR    (0x00004000UL)
#define MC_CAPCON_CLR_CAP2MCI1_FE_CLR    (0x00008000UL)
#define MC_CAPCON_CLR_CAP2MCI2_RE_CLR    (0x00010000UL)
#define MC_CAPCON_CLR_CAP2MCI2_FE_CLR    (0x00020000UL)
#define MC_CAPCON_CLR_RT0_CLR            (0x00040000UL)
#define MC_CAPCON_CLR_RT1_CLR            (0x00080000UL)
#define MC_CAPCON_CLR_RT2_CLR            (0x00100000UL)
#define MC_CAPCON_CLR_HNFCAP0_CLR        (0x00200000UL)
#define MC_CAPCON_CLR_HNFCAP1_CLR        (0x00400000UL)
#define MC_CAPCON_CLR_HNFCAP2_CLR        (0x00800000UL)

/* MCPWM interrupt enable register */
typedef struct{
__REG32 ILIM0       : 1;
__REG32 IMAT0       : 1;
__REG32 ICAP0       : 1;
__REG32             : 1;
__REG32 ILIM1       : 1;
__REG32 IMAT1       : 1;
__REG32 ICAP1       : 1;
__REG32             : 1;
__REG32 ILIM2       : 1;
__REG32 IMAT2       : 1;
__REG32 ICAP2       : 1;
__REG32             : 4;
__REG32 ABORT       : 1;
__REG32             :16;
} __mc_inten_bits;

/* MCPWM Interrupt Enable set */

#define MC_INTEN_SET_ILIM0_SET      (0x00000001UL)
#define MC_INTEN_SET_IMAT0_SET      (0x00000002UL)
#define MC_INTEN_SET_ICAP0_SET      (0x00000004UL)
#define MC_INTEN_SET_ILIM1_SET      (0x00000010UL)
#define MC_INTEN_SET_IMAT1_SET      (0x00000020UL)
#define MC_INTEN_SET_ICAP1_SET      (0x00000040UL)
#define MC_INTEN_SET_ILIM2_SET      (0x00000100UL)
#define MC_INTEN_SET_IMAT2_SET      (0x00000200UL)
#define MC_INTEN_SET_ICAP2_SET      (0x00000400UL)
#define MC_INTEN_SET_ABORT_SET      (0x00008000UL)

/* MCPWM Interrupt Enable clear */

#define MC_INTEN_CLR_ILIM0_CLR      (0x00000001UL)
#define MC_INTEN_CLR_IMAT0_CLR      (0x00000002UL)
#define MC_INTEN_CLR_ICAP0_CLR      (0x00000004UL)
#define MC_INTEN_CLR_ILIM1_CLR      (0x00000010UL)
#define MC_INTEN_CLR_IMAT1_CLR      (0x00000020UL)
#define MC_INTEN_CLR_ICAP1_CLR      (0x00000040UL)
#define MC_INTEN_CLR_ILIM2_CLR      (0x00000100UL)
#define MC_INTEN_CLR_IMAT2_CLR      (0x00000200UL)
#define MC_INTEN_CLR_ICAP2_CLR      (0x00000400UL)
#define MC_INTEN_CLR_ABORT_CLR      (0x00008000UL)

/* MCPWM Interrupt Flags */
typedef struct{
__REG32 ILIM0_F       : 1;
__REG32 IMAT0_F       : 1;
__REG32 ICAP0_F       : 1;
__REG32               : 1;
__REG32 ILIM1_F       : 1;
__REG32 IMAT1_F       : 1;
__REG32 ICAP1_F       : 1;
__REG32               : 1;
__REG32 ILIM2_F       : 1;
__REG32 IMAT2_F       : 1;
__REG32 ICAP2_F       : 1;
__REG32               : 4;
__REG32 ABORT_F       : 1;
__REG32               :16;
} __mc_intf_bits;

/* MCPWM Interrupt Flags set */

#define MC_INTEN_SET_ILIM0_F_SET      (0x00000001UL)
#define MC_INTEN_SET_IMAT0_F_SET      (0x00000002UL)
#define MC_INTEN_SET_ICAP0_F_SET      (0x00000004UL)
#define MC_INTEN_SET_ILIM1_F_SET      (0x00000010UL)
#define MC_INTEN_SET_IMAT1_F_SET      (0x00000020UL)
#define MC_INTEN_SET_ICAP1_F_SET      (0x00000040UL)
#define MC_INTEN_SET_ILIM2_F_SET      (0x00000100UL)
#define MC_INTEN_SET_IMAT2_F_SET      (0x00000200UL)
#define MC_INTEN_SET_ICAP2_F_SET      (0x00000400UL)
#define MC_INTEN_SET_ABORT_F_SET      (0x00008000UL)

/* MCPWM Interrupt Flags clear */

#define MC_INTEN_CLR_ILIM0_F_CLR      (0x00000001UL)
#define MC_INTEN_CLR_IMAT0_F_CLR      (0x00000002UL)
#define MC_INTEN_CLR_ICAP0_F_CLR      (0x00000004UL)
#define MC_INTEN_CLR_ILIM1_F_CLR      (0x00000010UL)
#define MC_INTEN_CLR_IMAT1_F_CLR      (0x00000020UL)
#define MC_INTEN_CLR_ICAP1_F_CLR      (0x00000040UL)
#define MC_INTEN_CLR_ILIM2_F_CLR      (0x00000100UL)
#define MC_INTEN_CLR_IMAT2_F_CLR      (0x00000200UL)
#define MC_INTEN_CLR_ICAP2_F_CLR      (0x00000400UL)
#define MC_INTEN_CLR_ABORT_F_CLR      (0x00008000UL)

/* Count control register */
typedef struct{
__REG32 TC0MCI0_RE  : 1;
__REG32 TC0MCI0_FE  : 1;
__REG32 TC0MCI1_RE  : 1;
__REG32 TC0MCI1_FE  : 1;
__REG32 TC0MCI2_RE  : 1;
__REG32 TC0MCI2_FE  : 1;
__REG32 TC1MCI0_RE  : 1;
__REG32 TC1MCI0_FE  : 1;
__REG32 TC1MCI1_RE  : 1;
__REG32 TC1MCI1_FE  : 1;
__REG32 TC1MCI2_RE  : 1;
__REG32 TC1MCI2_FE  : 1;
__REG32 TC2MCI0_RE  : 1;
__REG32 TC2MCI0_FE  : 1;
__REG32 TC2MCI1_RE  : 1;
__REG32 TC2MCI1_FE  : 1;
__REG32 TC2MCI2_RE  : 1;
__REG32 TC2MCI2_FE  : 1;
__REG32             :11;
__REG32 CNTR0       : 1;
__REG32 CNTR1       : 1;
__REG32 CNTR2       : 1;
} __mc_cntcon_bits;

/* Count control register set */

#define MC_CNTCON_SET_TC0MCI0_RE_SET      (0x00000001UL)
#define MC_CNTCON_SET_TC0MCI0_FE_SET      (0x00000002UL)
#define MC_CNTCON_SET_TC0MCI1_RE_SET      (0x00000004UL)
#define MC_CNTCON_SET_TC0MCI1_FE_SET      (0x00000008UL)
#define MC_CNTCON_SET_TC0MCI2_RE_SET      (0x00000010UL)
#define MC_CNTCON_SET_TC0MCI2_FE_SET      (0x00000020UL)
#define MC_CNTCON_SET_TC1MCI0_RE_SET      (0x00000040UL)
#define MC_CNTCON_SET_TC1MCI0_FE_SET      (0x00000080UL)
#define MC_CNTCON_SET_TC1MCI1_RE_SET      (0x00000100UL)
#define MC_CNTCON_SET_TC1MCI1_FE_SET      (0x00000200UL)
#define MC_CNTCON_SET_TC1MCI2_RE_SET      (0x00000400UL)
#define MC_CNTCON_SET_TC1MCI2_FE_SET      (0x00000800UL)
#define MC_CNTCON_SET_TC2MCI0_RE_SET      (0x00001000UL)
#define MC_CNTCON_SET_TC2MCI0_FE_SET      (0x00002000UL)
#define MC_CNTCON_SET_TC2MCI1_RE_SET      (0x00004000UL)
#define MC_CNTCON_SET_TC2MCI1_FE_SET      (0x00008000UL)
#define MC_CNTCON_SET_TC2MCI2_RE_SET      (0x00010000UL)
#define MC_CNTCON_SET_TC2MCI2_FE_SET      (0x00020000UL)
#define MC_CNTCON_SET_CNTR0_SET           (0x20000000UL)
#define MC_CNTCON_SET_CNTR1_SET           (0x40000000UL)
#define MC_CNTCON_SET_CNTR2_SET           (0x80000000UL)

/* Count control register */

#define MC_CNTCON_CLR_TC0MCI0_RE_CLR      (0x00000001UL)
#define MC_CNTCON_CLR_TC0MCI0_FE_CLR      (0x00000002UL)
#define MC_CNTCON_CLR_TC0MCI1_RE_CLR      (0x00000004UL)
#define MC_CNTCON_CLR_TC0MCI1_FE_CLR      (0x00000008UL)
#define MC_CNTCON_CLR_TC0MCI2_RE_CLR      (0x00000010UL)
#define MC_CNTCON_CLR_TC0MCI2_FE_CLR      (0x00000020UL)
#define MC_CNTCON_CLR_TC1MCI0_RE_CLR      (0x00000040UL)
#define MC_CNTCON_CLR_TC1MCI0_FE_CLR      (0x00000080UL)
#define MC_CNTCON_CLR_TC1MCI1_RE_CLR      (0x00000100UL)
#define MC_CNTCON_CLR_TC1MCI1_FE_CLR      (0x00000200UL)
#define MC_CNTCON_CLR_TC1MCI2_RE_CLR      (0x00000400UL)
#define MC_CNTCON_CLR_TC1MCI2_FE_CLR      (0x00000800UL)
#define MC_CNTCON_CLR_TC2MCI0_RE_CLR      (0x00001000UL)
#define MC_CNTCON_CLR_TC2MCI0_FE_CLR      (0x00002000UL)
#define MC_CNTCON_CLR_TC2MCI1_RE_CLR      (0x00004000UL)
#define MC_CNTCON_CLR_TC2MCI1_FE_CLR      (0x00008000UL)
#define MC_CNTCON_CLR_TC2MCI2_RE_CLR      (0x00010000UL)
#define MC_CNTCON_CLR_TC2MCI2_FE_CLR      (0x00020000UL)
#define MC_CNTCON_CLR_CNTR0_CLR           (0x20000000UL)
#define MC_CNTCON_CLR_CNTR1_CLR           (0x40000000UL)
#define MC_CNTCON_CLR_CNTR2_CLR           (0x80000000UL)

/* Dead-time register */
typedef struct{
__REG32 DT0         :10;
__REG32 DT1         :10;
__REG32 DT2         :10;
__REG32             : 2;
} __mc_dt_bits;

/* Current communication pattern register */
typedef struct{
__REG32 CCPA0       : 1;
__REG32 CCPB0       : 1;
__REG32 CCPA1       : 1;
__REG32 CCPB1       : 1;
__REG32 CCPA2       : 1;
__REG32 CCPB2       : 1;
__REG32             :26;
} __mc_ccp_bits;

